LynnL4/STM32H7_SAI/SAI_TEST.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=50390625
ProjectManager.MainLocation=Core/Src
PH0-OSC_IN.Signal=RCC_OSC_IN
RCC.SAI1Freq_Value=12500000
RCC.CortexFreq_Value=550000000
ProjectManager.TemplateDestinationPath=E\:\\Users\\Seeed\\STM32CubeIDE\\workspace_1.5.0\\SAI_TEST
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H725AEIx
RCC.HPRE=RCC_HCLK_DIV2
VP_FATFS_VS_SDIO.Mode=SDIO
RCC.PLL1_VCI_Range=RCC_PLL1VCIRANGE_3
PC12.Signal=SDMMC1_CK
PC10.Signal=SDMMC1_D2
RCC.PLLFRACN=0
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_USART3_UART_Init-USART3-false-HAL-true,4-MX_SAI4_Init-SAI4-false-HAL-true,5-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true,6-MX_FATFS_Init-FATFS-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PD8.Locked=true
RCC.RTCFreq_Value=32000
SAI4.FrameLength-SAI_A_MasterWithClock=64
RCC.PLL1_VCO_SEL-AdvancedSettings=RCC_PLL1VCOMEDIUM
RCC.CpuClockFreq_Value=550000000
RCC.VCO2OutputFreq_Value=100781250
ProjectManager.TemplateSourcePath=E\:\\ST\\STM32CubeIDE_1.5.0\\STM32CubeIDE\\plugins\\com.st.stm32cube.common.mx_6.2.1.202103241236\\db\\extra_templates
PD9.Mode=Asynchronous
SAI4.DataSize-SAI_A_MasterWithClock=SAI_DATASIZE_8
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
RCC.AHB4Freq_Value=275000000
RCC.VCOInput3Freq_Value=6250000
SAI4.SlotSize-SAI_A_MasterWithClock=SAI_SLOTSIZE_32B
USART3.VirtualMode-Asynchronous=VM_ASYNC
RCC.LPTIM1Freq_Value=137500000
PD13.Signal=SAI4_SCK_A
Mcu.IP4=RCC
Mcu.IP5=SAI4
PD13.Locked=true
Mcu.IP2=I2C4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=NVIC
Mcu.IP0=CORTEX_M7
Mcu.IP1=FATFS
Mcu.UserConstants=
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
RCC.DIVP3Freq_Value=100000000
RCC.SDMMCFreq_Value=12500000
Mcu.ThirdPartyNb=0
I2C4.Timing=0x60404E72
RCC.HCLKFreq_Value=275000000
RCC.I2C4Freq_Value=137500000
PE2.Mode=SAI_A_MasterWithClock
Mcu.IPNb=9
ProjectManager.PreviousToolchain=
RCC.SPDIFRXFreq_Value=64000000
RCC.DIVQ3Freq_Value=100000000
Mcu.Pin6=PC14-OSC32_IN
Mcu.Pin7=PD2
PD8.Signal=USART3_TX
Mcu.Pin8=PC9
Mcu.Pin9=PC8
PH0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin0=PE2
Mcu.Pin1=PC12
Mcu.Pin2=PC10
Mcu.Pin3=PC15-OSC32_OUT
Mcu.Pin4=PE3
Mcu.Pin5=PC11
ProjectManager.ProjectBuild=false
RCC.DIVR3Freq_Value=100000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.DIVM3=4
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.DIVM1=2
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
MxDb.Version=DB.6.0.21
RCC.DIVP1Freq_Value=550000000
RCC.PLL1_VCI_Range-AdvancedSettings=RCC_PLL1VCIRANGE_0
ProjectManager.BackupPrevious=true
RCC.FMCFreq_Value=275000000
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.SPDIFCLockSelection=RCC_SPDIFRXCLKSOURCE_HSI
RCC.USART16Freq_Value=137500000
File.Version=6
PC9.Mode=SD_4_bits_Wide_bus
PE3.Locked=true
PE2.Signal=SAI4_MCLK_A
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLL2_VCO_SEL-AdvancedSettings=RCC_PLL2VCOMEDIUM
RCC.DIVR2Freq_Value=50390625
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=50390625
ProjectManager.ProjectName=SAI_TEST
PF15.Mode=I2C
RCC.APB3Freq_Value=137500000
PH1-OSC_OUT.Mode=HSE-External-Oscillator
RCC.MCO2PinFreq_Value=550000000
Mcu.Package=UFBGA169
RCC.SAI4ACLockSelection=RCC_SAI4ACLKSOURCE_PLL3
PD11.Locked=true
RCC.D1PPRE=RCC_APB3_DIV2
PD12.Signal=SAI4_FS_A
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USART3.IPParameters=VirtualMode-Asynchronous
RCC.DFSDMFreq_Value=137500000
RCC.DIVR1Freq_Value=275000000
PC11.Mode=SD_4_bits_Wide_bus
RCC.TraceFreq_Value=64000000
RCC.APB4Freq_Value=137500000
RCC.CECFreq_Value=32000
PF14.Signal=I2C4_SCL
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=137500000
SAI4.RealAudioFreq-SAI_A_MasterWithClock=195.312 KHz
SAI4.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MckOutput-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,DataSize-SAI_A_MasterWithClock,ActiveFrameLength-SAI_A_MasterWithClock,FrameLength-SAI_A_MasterWithClock,SlotSize-SAI_A_MasterWithClock,SlotNumber-SAI_A_MasterWithClock
ProjectManager.CustomerFirmwarePackage=
RCC.Tim2OutputFreq_Value=275000000
RCC.DFSDMACLkFreq_Value=12500000
RCC.VCO3OutputFreq_Value=200000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
SAI4.ErrorAudioFreq-SAI_A_MasterWithClock=1.72 %
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
ProjectManager.ProjectFileName=SAI_TEST.ioc
RCC.DIVQ1=44
SAI4.ActiveFrameLength-SAI_A_MasterWithClock=32
Mcu.PinsNb=21
ProjectManager.NoMain=false
RCC.SAI4BCLockSelection=RCC_SAI4BCLKSOURCE_PLL3
PC11.Signal=SDMMC1_D3
SAI4.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
RCC.SWPMI1Freq_Value=137500000
RCC.SAI4BFreq_Value=100000000
PC8.Signal=SDMMC1_D0
PC10.Mode=SD_4_bits_Wide_bus
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
RCC.DIVP1=1
PD9.Signal=USART3_RX
ProjectManager.DeletePrevious=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.QSPIFreq_Value=275000000
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
PD12.Locked=true
RCC.SPI6Freq_Value=137500000
RCC.D1CPREFreq_Value=550000000
RCC.USART234578Freq_Value=137500000
RCC.SPI45Freq_Value=137500000
RCC.Tim1OutputFreq_Value=275000000
SDMMC1.TransceiverPresent=SDMMC_TRANSCEIVER_NOT_PRESENT
RCC.SPI123Freq_Value=12500000
SAI4.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.VCO1OutputFreq_Value=550000000
SAI4.MckOutput-SAI_A_MasterWithClock=SAI_MCK_OUTPUT_ENABLE
PF15.Locked=true
RCC.DIVN3=32
RCC.AXIClockFreq_Value=275000000
PD13.Mode=SAI_A_MasterWithClock
RCC.DIVN1=44
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=12500000
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PD8.Mode=Asynchronous
RCC.CKPERFreq_Value=64000000
PD2.Mode=SD_4_bits_Wide_bus
PC12.Mode=SD_4_bits_Wide_bus
board=custom
ProjectManager.LastFirmware=true
RCC.VCOInput1Freq_Value=12500000
RCC.AHB12Freq_Value=275000000
RCC.APB2Freq_Value=137500000
MxCube.Version=6.2.1
RCC.FDCANFreq_Value=12500000
PF14.Mode=I2C
RCC.RNGFreq_Value=48000000
RCC.ADCFreq_Value=50390625
VP_SYS_VS_Systick.Mode=SysTick
SAI4.SlotNumber-SAI_A_MasterWithClock=2
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PF15.Signal=I2C4_SDA
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF14.Locked=true
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM3,DIVN1,DIVN3,DIVP1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL1_VCI_Range,PLL1_VCI_Range-AdvancedSettings,PLL1_VCO_SEL-AdvancedSettings,PLL2_VCO_SEL-AdvancedSettings,PLL3_VCI_Range-AdvancedSettings,PLLFRACN,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI4ACLockSelection,SAI4AFreq_Value,SAI4BCLockSelection,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFCLockSelection,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H725AEIx
RCC.LPTIM2Freq_Value=137500000
RCC.PLL3_VCI_Range-AdvancedSettings=RCC_PLL3VCIRANGE_3
ProjectManager.UnderRoot=true
Mcu.IP8=USART3
Mcu.IP6=SDMMC1
PC8.Mode=SD_4_bits_Wide_bus
Mcu.IP7=SYS
ProjectManager.CoupleFile=true
RCC.SYSCLKFreq_VALUE=550000000
RCC.I2C123Freq_Value=137500000
Mcu.Pin20=VP_SYS_VS_Systick
PD12.Mode=SAI_A_MasterWithClock
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PD11.Signal=SAI4_SD_A
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ProjectManager.HeapSize=0x200
Mcu.Pin15=PD13
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PD9
Mcu.Pin13=PF15
PD11.Mode=SAI_A_MasterWithClock
Mcu.Pin14=PD11
Mcu.Pin19=VP_FATFS_VS_SDIO
RCC.LPTIM345Freq_Value=137500000
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PD12
Mcu.Pin18=PD8
RCC.LTDCFreq_Value=100000000
RCC.SAI4AFreq_Value=100000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PH1-OSC_OUT
Mcu.Pin12=PF14
Mcu.Pin10=PH0-OSC_IN
RCC.DIVQ1Freq_Value=12500000
PE3.Signal=SAI4_SD_B
RCC.D3PPRE=RCC_APB4_DIV2
PC9.Signal=SDMMC1_D1
SDMMC1.IPParameters=TransceiverPresent
PD2.Signal=SDMMC1_CMD
RCC.HCLK3ClockFreq_Value=275000000
RCC.VCOInput2Freq_Value=781250
PD9.Locked=true
RCC.APB1Freq_Value=137500000
ProjectManager.DeviceId=STM32H725AEIx
ProjectManager.LibraryCopy=1
I2C4.IPParameters=Timing
isbadioc=false
